Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128MU206.h
/* U1EIR */
#define _PIDEF U1EIRbits.PIDEF
#define _CRC5EF U1EIRbits.CRC5EF
#define _CRC16EF U1EIRbits.CRC16EF
#define _DFN8EF U1EIRbits.DFN8EF
#define _BTOEF U1EIRbits.BTOEF
#define _DMAEF U1EIRbits.DMAEF
#define _BUSACCEF U1EIRbits.BUSACCEF
#define _BTSEF U1EIRbits.BTSEF
#define _EOFEF U1EIRbits.EOFEF

/* U1EIE */
#define _PIDEE U1EIEbits.PIDEE
#define _CRC5EE U1EIEbits.CRC5EE
#define _CRC16EE U1EIEbits.CRC16EE
#define _DFN8EE U1EIEbits.DFN8EE
#define _BTOEE U1EIEbits.BTOEE
#define _DMAEE U1EIEbits.DMAEE
#define _BUSACCEE U1EIEbits.BUSACCEE
#define _BTSEE U1EIEbits.BTSEE
#define _EOFEE U1EIEbits.EOFEE

/* U1STAT */
#define _PPBI U1STATbits.PPBI
/* Bitname _DIR cannot be defined because it is used by more than one SFR */
#define _ENDPT U1STATbits.ENDPT
#define _ENDPT0 U1STATbits.ENDPT0
#define _ENDPT1 U1STATbits.ENDPT1
#define _ENDPT2 U1STATbits.ENDPT2
#define _ENDPT3 U1STATbits.ENDPT3

/* U1CON */
#define _USBEN U1CONbits.USBEN
#define _PPBRST U1CONbits.PPBRST
#define _RESUME U1CONbits.RESUME
#define _HOSTEN U1CONbits.HOSTEN
#define _PKTDIS U1CONbits.PKTDIS
#define _SE0 U1CONbits.SE0
#define _SOFEN U1CONbits.SOFEN
#define _USBRST U1CONbits.USBRST
#define _TOKBUSY U1CONbits.TOKBUSY
#define _JSTATE U1CONbits.JSTATE
#define _RESET U1CONbits.RESET

/* U1ADDR */
#define _DEVADDR U1ADDRbits.DEVADDR
#define _LSPDEN U1ADDRbits.LSPDEN
#define _DEVADDR0 U1ADDRbits.DEVADDR0
#define _DEVADDR1 U1ADDRbits.DEVADDR1
#define _DEVADDR2 U1ADDRbits.DEVADDR2
#define _DEVADDR3 U1ADDRbits.DEVADDR3
#define _DEVADDR4 U1ADDRbits.DEVADDR4
#define _DEVADDR5 U1ADDRbits.DEVADDR5
#define _DEVADDR6 U1ADDRbits.DEVADDR6
#define _LOWSPDEN U1ADDRbits.LOWSPDEN

/* U1BDTP1 */
#define _BDTPTRL U1BDTP1bits.BDTPTRL

/* U1FRML */
#define _FRM0 U1FRMLbits.FRM0
#define _FRM1 U1FRMLbits.FRM1
#define _FRM2 U1FRMLbits.FRM2
#define _FRM3 U1FRMLbits.FRM3
#define _FRM4 U1FRMLbits.FRM4
#define _FRM5 U1FRMLbits.FRM5
#define _FRM6 U1FRMLbits.FRM6
#define _FRM7 U1FRMLbits.FRM7

/* U1FRMH */
#define _FRM8 U1FRMHbits.FRM8
#define _FRM9 U1FRMHbits.FRM9
#define _FRM10 U1FRMHbits.FRM10

/* U1TOK */
#define _EP0 U1TOKbits.EP0
#define _EP1 U1TOKbits.EP1
#define _EP2 U1TOKbits.EP2
#define _EP3 U1TOKbits.EP3
#define _PID0 U1TOKbits.PID0
#define _PID1 U1TOKbits.PID1
#define _PID2 U1TOKbits.PID2
#define _PID3 U1TOKbits.PID3
#define _EP U1TOKbits.EP
#define _PID U1TOKbits.PID

/* U1SOF */
/* Bitname _CNT cannot be defined because it is used by more than one SFR */

/* U1BDTP2 */
#define _BDTPTRH U1BDTP2bits.BDTPTRH

/* U1BDTP3 */
#define _BDTPTRU U1BDTP3bits.BDTPTRU

/* U1CNFG1 */
#define _USBSIDL U1CNFG1bits.USBSIDL
#define _UOEMON U1CNFG1bits.UOEMON
#define _UTEYE U1CNFG1bits.UTEYE

/* U1CNFG2 */
#define _UTRDIS U1CNFG2bits.UTRDIS
#define _UVCMPDIS U1CNFG2bits.UVCMPDIS
#define _UVBUSDIS U1CNFG2bits.UVBUSDIS
#define _EXTI2CEN U1CNFG2bits.EXTI2CEN
#define _PUVBUS U1CNFG2bits.PUVBUS
#define _UVCMPSEL U1CNFG2bits.UVCMPSEL

/* U1EP0 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
#define _RETRYDIS U1EP0bits.RETRYDIS
#define _LSPD U1EP0bits.LSPD
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */
#define _LOWSPD U1EP0bits.LOWSPD

/* U1EP1 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP2 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP3 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP4 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP5 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP6 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

/* U1EP7 */
/* Bitname _EPHSHK cannot be defined because it is used by more than one SFR */
/* Bitname _EPSTALL cannot be defined because it is used by more than one SFR */
/* Bitname _EPTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPRXEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPCONDIS cannot be defined because it is used by more than one SFR */
/* Bitname _EPINEN cannot be defined because it is used by more than one SFR */
/* Bitname _EPOUTEN cannot be defined because it is used by more than one SFR */

