Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128MU206.h
#define _RPINR29_SDI3R6_POSITION                 0x00000006
#define _RPINR29_SDI3R6_MASK                     0x00000040
#define _RPINR29_SDI3R6_LENGTH                   0x00000001

#define _RPINR29_SCK3R0_POSITION                 0x00000008
#define _RPINR29_SCK3R0_MASK                     0x00000100
#define _RPINR29_SCK3R0_LENGTH                   0x00000001

#define _RPINR29_SCK3R1_POSITION                 0x00000009
#define _RPINR29_SCK3R1_MASK                     0x00000200
#define _RPINR29_SCK3R1_LENGTH                   0x00000001

#define _RPINR29_SCK3R2_POSITION                 0x0000000A
#define _RPINR29_SCK3R2_MASK                     0x00000400
#define _RPINR29_SCK3R2_LENGTH                   0x00000001

#define _RPINR29_SCK3R3_POSITION                 0x0000000B
#define _RPINR29_SCK3R3_MASK                     0x00000800
#define _RPINR29_SCK3R3_LENGTH                   0x00000001

#define _RPINR29_SCK3R4_POSITION                 0x0000000C
#define _RPINR29_SCK3R4_MASK                     0x00001000
#define _RPINR29_SCK3R4_LENGTH                   0x00000001

#define _RPINR29_SCK3R5_POSITION                 0x0000000D
#define _RPINR29_SCK3R5_MASK                     0x00002000
#define _RPINR29_SCK3R5_LENGTH                   0x00000001

#define _RPINR29_SCK3R6_POSITION                 0x0000000E
#define _RPINR29_SCK3R6_MASK                     0x00004000
#define _RPINR29_SCK3R6_LENGTH                   0x00000001

#define _RPINR30_SS3R_POSITION                   0x00000000
#define _RPINR30_SS3R_MASK                       0x0000007F
#define _RPINR30_SS3R_LENGTH                     0x00000007

#define _RPINR30_SS3R0_POSITION                  0x00000000
#define _RPINR30_SS3R0_MASK                      0x00000001
#define _RPINR30_SS3R0_LENGTH                    0x00000001

#define _RPINR30_SS3R1_POSITION                  0x00000001
#define _RPINR30_SS3R1_MASK                      0x00000002
#define _RPINR30_SS3R1_LENGTH                    0x00000001

#define _RPINR30_SS3R2_POSITION                  0x00000002
#define _RPINR30_SS3R2_MASK                      0x00000004
#define _RPINR30_SS3R2_LENGTH                    0x00000001

#define _RPINR30_SS3R3_POSITION                  0x00000003
#define _RPINR30_SS3R3_MASK                      0x00000008
#define _RPINR30_SS3R3_LENGTH                    0x00000001

#define _RPINR30_SS3R4_POSITION                  0x00000004
#define _RPINR30_SS3R4_MASK                      0x00000010
#define _RPINR30_SS3R4_LENGTH                    0x00000001

#define _RPINR30_SS3R5_POSITION                  0x00000005
#define _RPINR30_SS3R5_MASK                      0x00000020
#define _RPINR30_SS3R5_LENGTH                    0x00000001

#define _RPINR30_SS3R6_POSITION                  0x00000006
#define _RPINR30_SS3R6_MASK                      0x00000040
#define _RPINR30_SS3R6_LENGTH                    0x00000001

#define _RPINR37_SYNCI1R_POSITION                0x00000008
#define _RPINR37_SYNCI1R_MASK                    0x00007F00
#define _RPINR37_SYNCI1R_LENGTH                  0x00000007

#define _RPINR37_SYNCI1R0_POSITION               0x00000008
#define _RPINR37_SYNCI1R0_MASK                   0x00000100
#define _RPINR37_SYNCI1R0_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R1_POSITION               0x00000009
#define _RPINR37_SYNCI1R1_MASK                   0x00000200
#define _RPINR37_SYNCI1R1_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R2_POSITION               0x0000000A
#define _RPINR37_SYNCI1R2_MASK                   0x00000400
#define _RPINR37_SYNCI1R2_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R3_POSITION               0x0000000B
#define _RPINR37_SYNCI1R3_MASK                   0x00000800
#define _RPINR37_SYNCI1R3_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R4_POSITION               0x0000000C
#define _RPINR37_SYNCI1R4_MASK                   0x00001000
#define _RPINR37_SYNCI1R4_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R5_POSITION               0x0000000D
#define _RPINR37_SYNCI1R5_MASK                   0x00002000
#define _RPINR37_SYNCI1R5_LENGTH                 0x00000001

#define _RPINR37_SYNCI1R6_POSITION               0x0000000E
#define _RPINR37_SYNCI1R6_MASK                   0x00004000
#define _RPINR37_SYNCI1R6_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R_POSITION                0x00000000
#define _RPINR38_SYNCI2R_MASK                    0x0000007F
#define _RPINR38_SYNCI2R_LENGTH                  0x00000007

#define _RPINR38_DTCMP1R_POSITION                0x00000008
#define _RPINR38_DTCMP1R_MASK                    0x00007F00
#define _RPINR38_DTCMP1R_LENGTH                  0x00000007

#define _RPINR38_SYNCI2R0_POSITION               0x00000000
#define _RPINR38_SYNCI2R0_MASK                   0x00000001
#define _RPINR38_SYNCI2R0_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R1_POSITION               0x00000001
#define _RPINR38_SYNCI2R1_MASK                   0x00000002
#define _RPINR38_SYNCI2R1_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R2_POSITION               0x00000002
#define _RPINR38_SYNCI2R2_MASK                   0x00000004
#define _RPINR38_SYNCI2R2_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R3_POSITION               0x00000003
#define _RPINR38_SYNCI2R3_MASK                   0x00000008
#define _RPINR38_SYNCI2R3_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R4_POSITION               0x00000004
#define _RPINR38_SYNCI2R4_MASK                   0x00000010
#define _RPINR38_SYNCI2R4_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R5_POSITION               0x00000005
#define _RPINR38_SYNCI2R5_MASK                   0x00000020
#define _RPINR38_SYNCI2R5_LENGTH                 0x00000001

#define _RPINR38_SYNCI2R6_POSITION               0x00000006
#define _RPINR38_SYNCI2R6_MASK                   0x00000040
#define _RPINR38_SYNCI2R6_LENGTH                 0x00000001

#define _RPINR38_DTCMP1R0_POSITION               0x00000008
#define _RPINR38_DTCMP1R0_MASK                   0x00000100
#define _RPINR38_DTCMP1R0_LENGTH                 0x00000001

